# To maintain cask
#     brew update && brew upgrade brew-cask && brew cleanup && brew cask cleanup`

# Make sure apps get installed in system Application dir
cask_args appdir: '/Applications'

# Install native apps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'git'
brew 'node' # This installs `npm` too using the recommended installation method
brew 'nvm'
brew 'ruby'
brew 'tmux'
brew 'z'
brew 'zsh'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Design
cask 'sketch'
cask 'sketch-tool'

# Dev
cask 'iterm2'
cask 'sublime-text'
cask 'tower'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualhostx'

# Utility
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'cleanmymac'
cask 'delibar'
cask 'dropbox'
cask 'duet'
cask 'flux'
cask 'focus'
cask 'marked'
cask 'seil'
cask 'slack'
cask 'spectacle'
cask 'the-unarchiver'
cask 'transmission'

# Other
cask 'garmin-express'
cask 'spotify'
cask 'vlc'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-pt-sans'
cask 'font-pt-serif'

# Remove outdated versions from the cellar
# brew cleanup

# Not on cask but I want regardless.

# Momentum
# MoneyWiz
# Reeder
# Transmit
# Tweetbot


