# To maintain cask
#     brew update && brew upgrade brew-cask && brew cleanup && brew cask cleanup`

# Make sure apps get installed in system Application dir
cask_args appdir: '/Applications'

# Install native apps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/bundle'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'


# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'mas'
brew 'node' # This installs `npm` too using the recommended installation method
brew 'nvm'
brew 'ruby'
brew 'tmux'
brew 'trash'
brew 'vim', args: ['--override-system-vim']
brew 'wget'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Design
cask 'sketch'

# Dev
cask 'dash'
cask 'hyper'
cask 'iterm2'
cask 'sequal-pro'
cask 'sublime-text'
cask 'tower'
cask 'virtualbox'
cask 'virtualhostx'


# Utility
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'cleanmymac'
cask 'delibar'
cask 'dropbox'
cask 'duet'
cask 'focus'
cask 'marked'
cask 'seil'
cask 'slack'
cask 'spectacle'
cask 'the-unarchiver'
cask 'transmission'

# Other
cask 'spotify'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-pt-sans'
cask 'font-pt-serif'

# Install Mac App Store apps
mas 'MoneyWiz 2 - Personal Finance', id: 949724400
mas 'Reeder', id: 623795237
mas 'Transmit', id: 403388562
mas 'Tweetbot for Twitter', id: 557168941
mas 'Ulysses', id: 880001334
# Tweetbot


